{"movies":[{"title":"Matrix","rating":7,"year":1993,"plot":"Steven Matrix is one of the underworld's foremost hitmen until his luck runs out, and someone puts a contract out on him. Shot in the forehead by a .22 pistol, Matrix \"dies\" and finds himself in \"The City In Between\", where he is ...","genre":"Action, Drama, Fantasy","actors":"Nick Mancuso, Phillip Jarrett, Carrie-Anne Moss"},{"title":"The Lion King","rating":8,"year":1994,"plot":"Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself.","genre":"Animation, Adventure, Drama","actors":"Matthew Broderick, Jeremy Irons, James Earl Jones"},{"title":"Tenet","rating":7,"year":2020,"plot":"Armed with only one word, Tenet, and fighting for the survival of the entire world, a Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.","genre":"Action, Sci-Fi, Thriller","actors":"John David Washington, Robert Pattinson, Elizabeth Debicki"},{"title":"Sharknado","rating":3,"year":2013,"plot":"When a freak hurricane swamps Los Angeles, nature's deadliest killer rules sea, land, and air as thousands of sharks terrorize the waterlogged populace.","genre":"Action, Adventure, Comedy","actors":"Ian Ziering, Tara Reid, John Heard"},{"title":"Dragonball Evolution","rating":2,"year":2009,"plot":"The young warrior Son Goku sets out on a quest, racing against time and the vengeful King Piccolo, to collect a set of seven magical orbs that will grant their wielder unlimited power.","genre":"Action, Adventure, Fantasy","actors":"Justin Chatwin, James Marsters, Chow Yun-Fat"},{"title":"The Room","rating":3,"year":2003,"plot":"Johnny is a successful bank executive who lives quietly in a San Francisco townhouse with his fiancée, Lisa. One day, putting aside any scruple, she seduces Johnny's best friend, Mark. From there, nothing will be the same again.","genre":"Drama","actors":"Tommy Wiseau, Juliette Danielle, Greg Sestero"},{"title":"Troll 2","rating":2,"year":1990,"plot":"A vacationing family discovers that the entire town they're visiting is inhabited by goblins, disguised as humans, who plan to eat them.","genre":"Comedy, Fantasy, Horror","actors":"Michael Paul Stephenson, George Hardy, Margo Prey"},{"title":"Thor","rating":7,"year":2011,"plot":"The powerful but arrogant god Thor is cast out of Asgard to live amongst humans in Midgard (Earth), where he soon becomes one of their finest defenders.","genre":"Action, Adventure, Fantasy","actors":"Chris Hemsworth, Anthony Hopkins, Natalie Portman"},{"title":"Iron Man 2","rating":6,"year":2010,"plot":"With the world now aware of his identity as Iron Man, Tony Stark must contend with both his declining health and a vengeful mad man with ties to his father's legacy.","genre":"Action, Adventure, Sci-Fi","actors":"Robert Downey Jr., Mickey Rourke, Gwyneth Paltrow"},{"title":"Aquaman","rating":6,"year":2018,"plot":"Arthur Curry, the human-born heir to the underwater kingdom of Atlantis, goes on a quest to prevent a war between the worlds of ocean and land.","genre":"Action, Adventure, Fantasy","actors":"Jason Momoa, Amber Heard, Willem Dafoe"}],"user":[{"username":"swodax","health":10,"power":1}]}